load-test.yml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 0
  engines:
    socketio:
      options:
        transports: ["websocket"]
        upgrade: false

scenarios:
  - engine: socketio
    flow:
      - emit:
          channel: "register user"
          data: { name: "tester" }
          response:
            match:
              status: "ok"
      - emit:
          channel: "chat message"
          data: { text: "Hola desde test" }
          response:
            match:
              status: "ok"